{
	"companyHella": {
		"header": "Společnost",
		"label": "HELLA AUTOTECHNIK NOVA, s.r.o.",
		"company": true,
		"job": "MES Full-Stack vývojář",
		"firstCard": true,
		"values": [
			"Implementace a podpora softwaru pro výrobní MES systém.",
			"Vývoj progresivních webových aplikací pro zefektivnění výroby světlometů.",
			"Konzultace v oblasti vývoje a podpory MES systému.",
			"Spolupráce na mezinárodních projektech, komunikace v anglickém jazyce."
		]
	},
	"projectUnitExplorer": {
		"header": "Projekt",
		"label": "Unit Explorer",
		"company": false,
		"firstCard": false,
		"values": [
			"Jedná se o progresivní webovou aplikaci určenou k detailnímu zobrazení informací o konkrétním světlometu.",
			"Aplikace poskytuje přehled o průběhu testování, naměřených hodnotách, jednotlivých komponentách a dalších technických parametrech.",
			"I když je primárně optimalizována pro mobilní zařízení, je plně kompatibilní i s desktopovými platformami.",
			"Frontend je realizován pomocí HTML, CSS a Vaadin, zatímco backend je v programovacím jazyce Java."
		]
	},
	"projectProjectServer": {
		"header": "Projekt",
		"label": "Project Server",
		"company": false,
		"firstCard": false,
		"values": [
			"Jedná se o progresivní webovou aplikaci určenou pro spouštění JNLP projektů a sledování jejich běhu na různých zařízeních ve firmě.",
			"Aplikace nahrazuje zastaralý projektový server, který byl kompletně přepracován a rozšířen o nové funkce.",
			"Primárním zaměřením aplikace je desktopové použití, nicméně je funkční i na mobilních zařízeních.",
			"Frontend aplikace je postaven na technologiích HTML, CSS a Vaadin, zatímco backend je implementován v Javě."
		]
	},
	"selfEmployment": {
		"header": "Vedlejší činnost",
		"label": "Jakub Švihel Technologies",
		"company": true,
		"job": "Full-Stack vývojář",
		"firstCard": true,
		"values": [
			"Tvorba zakázkových webových aplikací a stránek pro firmy i jednotlivce.",
			"Poskytování komplexních služeb od návrhu UX/UI designu, přes full-stack vývoj až po finální nasazení a správu.",
			"Zprostředkovávání digitalizace podnikání, optimalizace pracovních procesů a zlepšení online prezentace."
		]
	},
	"oKrokNapred": {
		"header": "Projekt",
		"label": "O krok napřed",
		"company": false,
		"firstCard": false,
		"values": [
			"Webová stránka je navržena jako jednoduché a uživatelsky přívětivé řešení, které poskytuje přehledné a srozumitelné informace o rakovině, její prevenci a léčbě.",
            "Tento projekt je neziskový a byl navržen a realizován s cílem pomoci široké veřejnosti získat cenné informace o tomto závažném zdravotním tématu.",
			"Stránka je optimalizována pro snadnou navigaci a rychlý přístup k důležitým informacím.",
			"Použité technologie jsou React, Next.js, TypeScript, Tailwind CSS a Firebase."
		]
	},
	"diplomaThesis": {
		"header": "Diplomová práce",
		"label": "ClickFit",
		"company": false,
		"firstCard": true,
		"values": [
			"Má diplomová práce se zabývá vývojem webové aplikace pro tvorbu a správu tréninkových plánů, která kombinuje automatické generování a manuální tvorbu tréninkových plánů.",
			"Aplikace bude umožňovat uživatelům registrovat se, vytvářet a upravovat vlastní cvičební plány, sledovat pokroky prostřednictvím grafů a nastavovat cíle.",
			"Součástí bude i databáze cviků s popisy, možnost přidávat vlastní cviky, a také funkce pro komunikaci s ostatními uživateli.",
			"Technologie využívané při vývoji zahrnují React, MaterialUI, Tailwind, TypeScript, Node.js a Next.js."
		]
	},
	"bachelorThesis": {
		"header": "Bakalářská práce",
		"label": "Paziaatus",
		"company": false,
		"firstCard": false,
		"values": [
			"Jako bakalářskou práci jsem vytvořil hazardní desktopovou hru s RPG prvky a tématikou Star Wars, která je založena na konceptu již existujících her (Pazaak, Gladiatus, Shakes and Fidget, ...), avšak s originálním provedením.",
			"V rámci práce jsem se zabýval nejen implementací samotné hry, ale také analýzou herních technologií a metodiky vývoje.",
			"Hra implementuje algoritmus počítačového protihráče, který je schopen analyzovat situaci a vytvořit strategii během karetní partie.",
			"Herní logika je napsána v programovacím jazyce Java a vizuální prvky jsem vytvořil pomocí modelu DALLE-E 2 a grafickém editoru Photoshop."
		]
	}
}
