{
	"companyHella": {
		"header": "Company",
		"label": "HELLA AUTOTECHNIK NOVA, s.r.o.",
		"company": true,
		"job": "MES Full-Stack Developer",
		"firstCard": true,
		"values": [
			"Implementation and support of software for manufacturing MES system.",
			"Development of progressive web-based applications to streamline headlight production.",
			"Consultancy on MES system development and support.",
			"Cooperation on international projects, communication in English language."
		]
	},
	"projectUnitExplorer": {
		"header": "Project",
		"label": "Unit Explorer",
		"company": false,
		"firstCard": false,
		"values": [
			"This is a progressive web application designed to display detailed information about a specific headlight. The application provides an overview of the testing process, measured values, individual components and other technical parameters. Although primarily optimized for mobile devices, it is also fully compatible with desktop platforms. The frontend is implemented using HTML, CSS and Vaadin, while the backend is in Java programming language."
		]
	},
	"projectProjectServer": {
		"header": "Project",
		"label": "Project Server",
		"company": false,
		"firstCard": false,
		"values": [
			"It is a progressive web application designed to run JNLP projects and monitor their progress on different devices in the company. The application replaces the outdated project server, which has been completely redesigned and enhanced with new features. The primary focus of the app is desktop use, however it is functional on mobile devices as well. The frontend of the application is built on HTML, CSS and Vaadin technologies, while the backend is implemented in Java."
		]
	},
	"selfEmployment": {
		"header": "Secondary activity",
		"label": "Jakub Švihel Technologies",
		"company": true,
		"job": "Full-Stack Developer",
		"firstCard": true,
		"values": [
			"Creation of custom web applications and websites for companies and individuals.",
			"Facilitating business digitization and improving online presence.",
			"Providing comprehensive services from UX/UI design, through full-stack development to final deployment and management."
		]
	},
	"oKrokNapred": {
		"header": "Project",
		"label": "O krok napřed",
		"company": false,
		"firstCard": false,
		"values": [
			"The website provides clear and easy-to-understand information about cancer, its prevention and treatment options. This non-profit project is undertaken to help the general public. The site is optimized for easy navigation and quick access to important information. React, Next.js, TypeScript, Tailwind CSS, and Firebase technologies are used to develop it."
		]
	},
	"diplomaThesis": {
		"header": "Diploma thesis",
		"label": "ClickFit",
		"company": false,
		"firstCard": true,
		"values": [
			"As part of my diploma thesis, I designed and implemented the web application KlikFit, which allows users to create, manage, and view individual training plans, track athletic progress, and communicate with each other. Training plans can be created manually or automatically based on user-defined parameters. The application is built on React, Next.js, MaterialUI, Tailwind, TypeScript, Node.js, and MySQL technologies."
		]
	},
	"bachelorThesis": {
		"header": "Bachelor thesis",
		"label": "Paziaatus",
		"company": false,
		"firstCard": true,
		"values": [
			"For my bachelor thesis, I created a gambling desktop game with RPG elements and a Star Wars theme, based on the concept of existing games (Pazaak, Gladiatus, Shakes and Fidget, ...) but with an original implementation. As part of my work, I not only implemented the game itself, but also analyzed the game technology and development methodology. The game implements a computer opponent algorithm that is able to analyze the situation and create a strategy during a card game. The game logic is written in the Java programming language and I created the visual elements using the DALLE-E 2 model and the Photoshop graphics editor."
		]
	}
}
